_ACADNUSX_TO_GEO_MAP = {
    # აბგდე
    "a": "ა",
    "b": "ბ",
    "g": "გ",
    "d": "დ",
    "e": "ე",
    # ვზთიკ
    "v": "ვ",
    "z": "ზ",
    "T": "თ",
    "i": "ი",
    "k": "კ",
    # ლმნოპ
    "l": "ლ",
    "m": "მ",
    "n": "ნ",
    "o": "ო",
    "p": "პ",
    # ჟრსტუ
    "J": "ჟ",
    "r": "რ",
    "s": "ს",
    "t": "ტ",
    "u": "უ",
    # ფქღყშ
    "f": "ფ",
    "q": "ქ",
    "R": "ღ",
    "y": "ყ",
    "": "შ",
    # ჩცძწჭ
    "C": "ჩ",
    "c": "ც",
    "Z": "ძ",
    "w": "წ",
    "W": "ჭ",
    # ხჯჰ
    "x": "ხ",
    "j": "ჯ",
    "h": "ჰ",
}


def replace_an_to_geo(val: str) -> str:
    return "".join(_ACADNUSX_TO_GEO_MAP.get(v, v) for v in val)
